using System;
using System.Collections.Generic;
using System.Linq;
using System.Threading.Tasks;

namespace FoodetoryMenuGeorgian.Models
{
    public class DescriptionArm
    {
        public Dictionary<string, string> descriptions = new Dictionary<string, string>();
        public DescriptionArm()
        {
            descriptions.Add("Վեգան Մակի", "բրինձ, կրեմ-պանիր, նորի, վարունգ");
            descriptions.Add("Սաղմոնով Մակի", "բրինձ, կրեմ-պանիր, նորի, սաղմոն ");
            descriptions.Add("Ապխտած սաղմոնով Մակի", "բրինձ, կրեմ-պանիր, նորի, ապծտած սաղմոն");
            descriptions.Add("Ավոկադոյով Մակի", "բրինձ, կրեմ-պանիր, նորի, ավոկադո");
            descriptions.Add("Կապպա Մակի", "բրինձ, կրեմ-պանիր, նորի, վարունգ, քունջութ ");
            descriptions.Add("Ունագի Մակի", "բրինձ, կրեմ-պանիր, նորի, օձաձուկ ");
            descriptions.Add("Չուկա Մակի", "բրինձ, կրեմ-պանիր, նորի, չուկա");
            descriptions.Add("Էբի Մակի", "բրինձ, կրեմ-պանիր, նորի, ծովախեցգետին");
            descriptions.Add("Թունայով Մակի", "բրինձ, կրեմ-պանիր, նորի, թունա ձուկ");
            descriptions.Add("Ֆիլադելֆիա օրանժ", "պանիր, սաղմոն, վարունգ, ավոկադո ");
            descriptions.Add("Ֆիլադելֆիա դասական", "պանիր կրեմետե, ավոկադո, սաղմոնի ֆիլե ");
            descriptions.Add("Դրակոն", "օձաձուկ, ծովախեցգետնի ձողիկներ, ավոկադո, վարունգ");
            descriptions.Add("Գրին Ալյասկա", "պանիր, վարունգ, ապխտած սաղմոն, սամիթ ");
            descriptions.Add("Լայեր", "սաղմոն, պանիր կրեմետե, խավիար ");
            descriptions.Add("Սանշայն", "օձաձուկ, ծովախեցգետին, սաղմոնի ֆիլե ");
            descriptions.Add("Դաբլ-չիզ", "պանիր կրեմետե, պանիր պրեզիդենտ, վարունգ ");
            descriptions.Add("Շախմատ", "սաղմոն, թունա, տոբիկո, վարունգ ");
            descriptions.Add("Պիրամիդա", "սաղմոնի ֆիլե, վարունգ, տոբիկո, պանիր կրեմետե ");
            descriptions.Add("Կանադա", "օձաձուկ, պանիր կրեմետե, ավոկադո, ծովախեցգետնի ձողիկներ ");
            descriptions.Add("Վալենտինկա", "թունայի ֆիլե, տոբիկո, վարունգ, պանիր կրեմետե ");
            descriptions.Add("Կալիֆորնիա", "տոբիկո, վարունգ, ավոկադո, ծովախեցգետնի ձողիկներ ");
            descriptions.Add("Կեսար", "պանիր կրեմետե, հազարի տերև, վարունգ, պանիր Gran Spicco ");
            descriptions.Add("Էբի կալիֆորնիա", "տոբիկո, վարունգ, ավոկադո, ծովախեցգետին");
            descriptions.Add("Գրին Դրակոն", "ունագի, սաղմոնի ֆիլե, ավոկադո, վարունգ, ուգր, պանիր կրեմետե ");
            descriptions.Add("Քրեյզի Էբի", "սաղմոն, վարունգ, պանիր կրեմետե, տոբիկո, ծովախեցգետին  ");
            descriptions.Add("Ունագի Յակի", "ավոկադո, ունագի ");
            descriptions.Add("Բիֆ Յակի", "տավարի միս, թունա, վարունգ, ավոկադո, պանիր ");
            descriptions.Add("Էբի Տեմպուրա", "ծովախեցգետնի ձողիկներ, ավոկադո ");
            descriptions.Add("Սաղմոնով Տեմպուրա", "սաղմոն, պանիր, ավոկադո, վարունգ ");
            descriptions.Add("Վեգան Տեմպուրա", "պղպեղ, վարունգ ");
            descriptions.Add("Ունագի Տեմպուրա", "օձաձուկ, պանիր, վարունգ, տոբիկո, ավոկադո ");
            descriptions.Add("Թունա-սուշի", "թունա, բրինձ");
            descriptions.Add("Սաղմոն-սուշի", "սաղմոն, բրինձ");
            descriptions.Add("Ավոկադո-սուշի", "ավոկադո, բրինձ");
            descriptions.Add("Ունագի-սուշի", "օձաձուկ, բրինձ");
            descriptions.Add("Ծովախեցգետին-սուշի", "ծովախեցգետին, բրինձ");
            descriptions.Add("Ունագի Գուն-Կան", "ունագի, սոուս, բրինձ, նորի");
            descriptions.Add("Սաղմոնով Գուն-Կան", "սաղմոն, սոուս, բրինձ, նորի");
            descriptions.Add("Ծովախեցգետնով Գուն-Կան", "ծովախեցգետին, բրինձ, նորի");
            descriptions.Add("Սաղմոնով, ձկնկիթով Գուն-Կան", "սաղմոնի ձկնկիթ, բրինձ, նորի");
            descriptions.Add("Ունագի Տեմակի", "օձաձուկ, վարունգ,ավոկադո, պանիր");
            descriptions.Add("Էբի Տեմակի", "ծովախեցգետին, վարունգ ");
            descriptions.Add("Սաղմոնով Տեմակի", "սաղմոն, վարունգ, խավիար ");
            descriptions.Add("Թունայով Տեմակի", "թունա, վարունգ ");
            descriptions.Add("Ձկնկիթով Տեմակի", "ձկնկիթ, վարունգ, ավոկադո, պանիր");
            descriptions.Add("Սաղմոնի Սաշիմի", "սաղմոնի ֆիլե");
            descriptions.Add("Թունայով Սաշիմի", "թունայի ֆիլե");
            descriptions.Add("Ապխտած ուգրով Սաշիմի", "օձաձկան ֆիլե");
            descriptions.Add("Ծովախեցգետնի Սաշիմի", "ծովախեցգետին");
            descriptions.Add("Ծովային սնկով Սաշիմի", "ծովային սունկ");
            descriptions.Add("Պիցցա Ծովային Տեսականի", "խեցգետնի միս, ծովախեցգետին, ուգր, սաղմոն, տոբիկո, ծովային սունկ");
            descriptions.Add("Ծովախեցգետնով սենդվիչ", "բուլղարական պղպեղ, վարունգ, պանիր");
            descriptions.Add("Խոզի ականջներ 250g", "բուլղարական պղպեղ, վարունգ, ծովային սունկ ");
            descriptions.Add("Չուկյա 160g", "բուլղարական պղպեղ, ընկույզի սոուս, չուկա ");
            descriptions.Add("Կալիֆորնիա Աղցան", "բուլղարական պղպեղ, ծովախեցգետին, չերրի լոլիկ, սխտորի սոուս");
            descriptions.Add("Միսո ապուր ծովախեցգետնով", "ծովախեցգետին, ջրիմուռ, շամպինիոն");
            descriptions.Add("Տոմ-Յամ", "ծովախեցգետին, կախասունկ, չերրի լոլիկ, չիլի ");
            descriptions.Add("Խոզի մսով ֆունչոզա", "խոզի միս, ֆունչոզա, բուլղարական պղպեղ, կանաչ լոբի, սոխ պարեյ, իմբիր ");
            descriptions.Add("Խոզի մսով Ուդոն", "ցորենի լապշա, խոզի միս, բուլղարական պղպեղ, գազար, կանաչ լոբի, սոխ պարեյ, իմբիր");
            descriptions.Add("Խոզի մսով Սոբա", "հնդկաձավարի լապշա, խոզի միս, կանաչ լոբի, բուլղարական պղպեղ, սխտար, սոխ պարեյ, իմբիր");
            descriptions.Add("Խոզի մսով Տամագո", "ձվի լապշա, խոզի միս, բուլղարական պղպեղ, կանաչ լոբի, սոխ պարեյ, իմբիր ");
            descriptions.Add("Հավի մսով Ֆունչոզա", "բրնձի լապշա, հավի կրծքամիս, բուլղարական պղպեղ, կանաչ լոբի, սոխ պարեյ, իմբիր ");
            descriptions.Add("Հավի մսով Սոբա", "հավի կրծքամիս, բուլղարական պղպեղ, կանաչ լոբի, սոխ պարեյ, սխտոր, իմբիր ");
            descriptions.Add("Հավի մսով ձվի Տամագո", "հավի կրծքամիս, բուլղարական պղպեղ, կանաչ լոբի, սոխ պարեյ, սխտոր, իմբիր ");
            descriptions.Add("Հավի մսով Ուդոն", "հավի կրծքամիս, ուդոն, գազար, բուլղարական պղպեղ, սոխ պարեյ, սխտոր, իմբիր");
            descriptions.Add("Տավարի մսով Սոբա", "տավարի միս, հնդկաձավարի լապշա, բուլղարական պղպեղ, կանաչ լոբի, սոխ պարեյ, սխտոր ");
            descriptions.Add("Տավարի մսով ձվի Տամագո", "տավարի միս, ձվի տամակո, բուլղարական պղպեղ, կանաչ լոբի, սոխ պարեյ, իմբիր ");
            descriptions.Add("Տավարի մսով Ուդոն", "տավարի միս, ուդոն, բուլղարական պղպեղ, սխտոր, սոխ պարեյ, իմբիր ");
            descriptions.Add("Տավարի մսով Ֆունչոզա", "տավարի միս, ֆունչոզա, կանաչ լոբի, բուլղարական պղպեղ, գազար, սոխ պարեյ, սխտոր ");
            descriptions.Add("Ծովային կոկտեյլ Սոբա", "սոբա, բրոկոլի, իմբիր, գազար, դդմիկ ");
            descriptions.Add("Ծովային կոկտեյլ Տամագո", "տամագո, բրոկոլի, գազար, դդմիկ, իմբիր ");
            descriptions.Add("Ծովային կոկտեյլ Ուդոն", "ուդոն, բրոկոլի, իմբիր, գազար, դդմիկ ");
            descriptions.Add("Ծովային կոկտեյլ Ֆունչոզա", "ֆունչոզա, բրոկոլի, դդմիկ, գազար, իմբիր ");
            descriptions.Add("Սնկով վոկ Ուդոն", "օպյատա, կախասունկ, շամպինիոն, բրոկոլի, բուլղարական պղպեղ, դդմիկ ");
            descriptions.Add("Սնկով վոկ բրնձով", "օպյատա, կախասունկ, շամպինիոն, բրոկոլի, ճապոնական բրինձ ");
            descriptions.Add("Սնկով վոկ ֆունչոզա", "օպյատա, կախասունկ, շամպինիոն, բրոկոլի, դդմիկ, բուլղարական պղպեղ ");
            descriptions.Add("Սեթ 1 – Սաղմոնի սեթ– 40 հատ", "0");
            descriptions.Add("Սեթ 2 – Տաք ռոլլի սեթ – 33 հատ", "0");
            descriptions.Add("Սեթ 3 – Սեթ Մակի – 50 հատ", "0");
            descriptions.Add("Սեթ 4 – Սեթ Բիգ – 80 հատ", "0");
        }
    }
}
